     /* 중첩 함수 */
     /*
     * - 함수 내부에 정의된 또 다른 함수를 "중첩함수" 또는 " 내부함수"라고 한다
     * - "내부함수"를 포함한 함수는 "외부함수"라고 함
     * - "중첩함수"는 보통 "외부함수"를 돕는 헬퍼 역할을 한다
     * */
     function outer(){
         var outerVal = "외부함수 변수"
         function  inner() {
             var innerVal = "내부함수 변수"

             /* 외부 함수의 변수를 내부 함수에서 참조할 수 있다*/
             console.log(`outerVal : ${outerVal}`);
             console.log(`outerVal : ${innerVal}`);
             return `${outerVal} / ${innerVal}`;
         }
         /* 내부 함수의 변수는 외부 함수에서 참조할 수 없다.*/
         // console.log(`innerVal : ${innerVal}`);

         console.log(inner());
     }
     // outer() 호출 -> 반환된 결과로 log 출력
     outer()

/* Closure \변형
 inner()를 실행하지 않고, 함수 자체를 밖으로 던져주면(return) */
     function outer(){
         var outerVal = "외부함수 변수"

         function inner() {
             // inner는 여전히 outerVal을 기억하고 있음!
             console.log(outerVal);
         }

         return inner; // ⭐️ 실행() 하지 않고 함수 자체를 반환!
     }

     const myFunc = outer(); // outer는 실행되고 끝났음(죽었음).
     myFunc(); // 😲 근데 myFunc(inner)를 실행하니 죽은 outer의 변수가 살아나서 출력됨!